from django.shortcuts import render
from django.http import JsonResponse

from rest_framework.response import Response
from rest_framework.decorators import api_view
from rest_framework import status
from .serializers import TodolistSerializer
from .models import Todolist


# GET Data
@api_view(['GET'])
def all_todolist(request):
    alltodolist = Todolist.objects.all()  # ดึงข้อมูล จาก model Todolist
    serializer = TodolistSerializer(alltodolist, many=True)
    return Response(serializer.data, status=status.HTTP_200_OK)


# POST Data (save data to database)
@api_view(['POST'])
def post_todolist(request):
    if request.method == 'POST':
        serializer = TodolistSerializer(data=request.data)
        if serializer.is_valid():
            serializer.save()
            return Response(serializer.data, status=status.HTTP_201_CREATED)
        return Response(serializer.errors, status=status.HTTP_404_NOT_FOUND)


@api_view(['PUT'])
def update_todolist(request, TID):
    # localhost:8000/api/update-todolist/13
    todo = Todolist.objects.get(id=TID)

    if request.method == 'PUT':
        data = {}
        serializer = TodolistSerializer(todo, data=request.data)
        if serializer.is_valid():
            serializer.save()
            data['status'] = 'updated'
            return Response(data=data, status=status.HTTP_201_CREATED)
        return Response(serializer.errors, status=status.HTTP_404_NOT_FOUND)


@api_view(['DELETE'])
def delete_todolist(request, TID):
    todo = Todolist.objects.get(id=TID)

    if request.method == 'DELETE':
        delete = todo.delete()
        data = {}
        if delete:
            data['status'] = 'deleted'
            statuscode = status.HTTP_200_OK
        else:
            data['status'] = 'failed'
            statuscode = status.HTTP_400_BAD_REQUEST
        return Response(data=data, status=statuscode)


data = [
    {
        "title": "เครื่องสูบน้ำดับเพลิง",
        "subtitle": "รู้ถึงส่วนประกอป การใช้งาน และดูแลรักษาเครื่องสูบน้ำดับเพลิง",
        "image_url": "https://raw.githubusercontent.com/woravi/layout/master/assets/engin1.png",
        "detail": "การทำงานของเครื่องสูบน้ำประเภทต่าง ๆ\nเครื่องสูบน้ำมีทั้งแบบที่ใช้มอเตอร์ไฟฟ้า และแบบที่ใช้เครื่องยนต์ เพื่อทำหน้าที่หมุนส่งกำลังให้เครื่องสูบทำงานเพิ่มแรงดันและส่งน้ำไปตามท่อ โดยแบบที่ใช้ในบ้านส่วนใหญ่จะเป็นแบบไฟฟ้า ซึ่งจะแบ่งออกเป็น 2 กลุ่มใหญ่ ๆ คือ\nเครื่องสูบน้ำแบบใบพัด\nทำงานด้วยการหมุนของใบพัด ทำให้เกิดแรงดันจ่ายไปตามท่อน้ำ มีข้อดีที่ขนาดเล็ก หลักการทำงานที่เรียบง่าย มีชิ้นส่วนน้อย จ่ายน้ำได้ในปริมาณมาก และสร้างแรงดันน้ำได้มากพอควร ซึ่งหากต้องการแรงดันสูงก็สามารถนำหลายเครื่องมาต่อพ่วงกันเป็นทอด ๆ ได้ ปัจจุบันนิยมใช้เครื่องสูบน้ำประเภทนี้กันมาก และมีชื่อเรียกแตกต่างกันออกไปตามรูปร่างลักษณะของตัวเครื่อง เช่นเครื่องสูบน้ำการทำงานของเครื่องสูบน้ำประเภทต่าง ๆ\nเครื่องสูบน้ำมีทั้งแบบที่ใช้มอเตอร์ไฟฟ้า และแบบที่ใช้เครื่องยนต์ เพื่อทำหน้าที่หมุนส่งกำลังให้เครื่องสูบทำงานเพิ่มแรงดันและส่งน้ำไปตามท่อ โดยแบบที่ใช้ในบ้านส่วนใหญ่จะเป็นแบบไฟฟ้า ซึ่งจะแบ่งออกเป็น 2 กลุ่มใหญ่ ๆ คือ\nเครื่องสูบน้ำแบบใบพัด\nทำงานด้วยการหมุนของใบพัด ทำให้เกิดแรงดันจ่ายไปตามท่อน้ำ มีข้อดีที่ขนาดเล็ก หลักการทำงานที่เรียบง่าย มีชิ้นส่วนน้อย จ่ายน้ำได้ในปริมาณมาก และสร้างแรงดันน้ำได้มากพอควร ซึ่งหากต้องการแรงดันสูงก็สามารถนำหลายเครื่องมาต่อพ่วงกันเป็นทอด ๆ ได้ ปัจจุบันนิยมใช้เครื่องสูบน้ำประเภทนี้กันมาก และมีชื่อเรียกแตกต่างกันออกไปตามรูปร่างลักษณะของตัวเครื่อง เช่นเครื่องสูบน้ำอัตโนมัติ เครื่องสูบน้ำแบบหอยโข่ง ปั๊มไดโว่ เป็นต้น ในสมัยก่อนการใช้แครื่องยนต์ทดแรง มีการใช้ระหัด (rahat หริอ chain pump) ในการสูบน้ำ ซึ่งเรียกว่า การชักน้ำหรือวิดน้ำ ด้วยแรงคน แรงสัตว์ แรงกลจากลมหรือน้ำ โดยผ่านบริเวณที่จำกัดคือ รางระหัดซึ่งประกอบกับสายพานที่มีใบชักหลายใบหรือกระบอกคล้ายโซ่จักรยาน ในการชักน้ำทีละน้อย ๆ\nเครื่องสูบน้ำแบบลูกสูบ\nทำงานด้วยการชักลูกสูบเลื่อนไปมาในลูกสูบ และมีวาล์วเปิดปิดน้ำเข้าออกจากลูกสูบซึ่งจะเป็นการเพิ่มแรงดันน้ำโดยตรง ในสมัยก่อนจะนิยมใช้กันมากโดยเฉพาะในสวน ปัจจุบันไม่ค่อยเป็นที่นิยมแล้ว ข้อดีของเครื่องประเภทนี้คือสามารถสร้างแรงดันน้ำได้สูง แต่มีข้อเสียที่ให้ปริมาณน้ำน้อย และมีการสึกหรอของลูกสูบมาก\nเครื่องสูบน้ำแบบใบเกลียว\nการสูบน้ำแบบใบเกลียว (Progressive cavity pump และ Screw pump) มีหลักการทำงานแบบเกลียวอาร์คิมิดีส ด้วยการหมุนเกลียวในการผลักน้ำ เครื่องสูบแบบนี้สามารถพัฒนาแรงดันสูงมากแต่ปริมาณการสูบต่ำ เหมาะสำหรับการสูบน้ำที่มีสิ่งเจือปนขนาดใหญ่ หรือมีสิ่งปฏิกูลปนอยู่มาก เนื่องจากมีความหนืดสูงต้องใช้กำลังในการผลักหรือสูบมาก\nอัตโนมัติ เครื่องสูบน้ำแบบหอยโข่ง ปั๊มไดโว่ เป็นต้น ในสมัยก่อนการใช้แครื่องยนต์ทดแรง มีการใช้ระหัด (rahat หริอ chain pump) ในการสูบน้ำ ซึ่งเรียกว่า การชักน้ำหรือวิดน้ำ ด้วยแรงคน แรงสัตว์ แรงกลจากลมหรือน้ำ โดยผ่านบริเวณที่จำกัดคือ รางระหัดซึ่งประกอบกับสายพานที่มีใบชักหลายใบหรือกระบอกคล้ายโซ่จักรยาน ในการชักน้ำทีละน้อย ๆ\nเครื่องสูบน้ำแบบลูกสูบ\nทำงานด้วยการชักลูกสูบเลื่อนไปมาในลูกสูบ และมีวาล์วเปิดปิดน้ำเข้าออกจากลูกสูบซึ่งจะเป็นการเพิ่มแรงดันน้ำโดยตรง ในสมัยก่อนจะนิยมใช้กันมากโดยเฉพาะในสวน ปัจจุบันไม่ค่อยเป็นที่นิยมแล้ว ข้อดีของเครื่องประเภทนี้คือสามารถสร้างแรงดันน้ำได้สูง แต่มีข้อเสียที่ให้ปริมาณน้ำน้อย และมีการสึกหรอของลูกสูบมาก\nเครื่องสูบน้ำแบบใบเกลียว\nการสูบน้ำแบบใบเกลียว (Progressive cavity pump และ Screw pump) มีหลักการทำงานแบบเกลียวอาร์คิมิดีส ด้วยการหมุนเกลียวในการผลักน้ำ เครื่องสูบแบบนี้สามารถพัฒนาแรงดันสูงมากแต่ปริมาณการสูบต่ำ เหมาะสำหรับการสูบน้ำที่มีสิ่งเจือปนขนาดใหญ่ หรือมีสิ่งปฏิกูลปนอยู่มาก เนื่องจากมีความหนืดสูงต้องใช้กำลังในการผลักหรือสูบมาก\n\n"
    },
    {
        "title": "สายน้ำดับเพลิง",
        "subtitle": "รู้ถึงส่วนประกอป การใช้งาน และดูแลรักษาสายดับเพลิง",
        "image_url": "https://raw.githubusercontent.com/woravi/layout/master/assets/line1.png",
        "detail": "สายส่งน้ำที่มีขายในท้องตลาดทั่วไปในประเทศไทยนั้นมีอยู่ 3 ขนาด\n\n1. สายดับเพลิง ขนาด 1.5 นิ้ว\n2. สายดับเพลิง ขนาด 2 นิ้ว\n3. สายดับเพลิง ขนาด 2.5 นิ้ว\n\nสายส่งน้ำนั้นจะมีขนาดให้เลือกใช้มากมาย เริ่มตั้งแต่ 1 นิ้ว ไปจนถึง 12 นิ้ว ผู้อ่านบางท่านอาจจะชักเริ่มสงสัยแล้วว่า สายขนาด 12 นิ้ว เนี่ยจะถือไหวรึ สายขนาดนี้ในต่างประเทศจะไว้ใช้ส่งน้ำ\n\nขอแนะนำข้อมูลของสายแค่ 2 ชนิดก่อนก็แล้วกัน คือขนาด 1.5 นิ้ว และ 2.5 นิ้ว ซึ่งเป็นสายที่ได้รับความนิยมอย่างมากในบ้านเรา\n\nสายส่งน้ำแต่ละขนาดนั้นมี ข้อดีข้อเสียแตกต่างกันไป ยิ่งสายดับเพลิงที่มีใหญ่กว่าก็จะสามารถจ่ายน้ำได้ในปริมาณที่มากกว่า แต่ถ้าพูดถึงความแรงแล้ว สายดับเพลิงที่มีขนาดเล็ก เช่นสายดับเพลิงขนาด 1.5 นิ้ว นั้นจะสามารถทำแรงดันเพื่อส่งน้ำดับเพลิงได้ดีกว่าเป็นต้น\n\nคุณสมบัติของสายดับเเพลิงทั้ง 2 ชนิด\n\n1. ปริมาณการจ่ายน้ำสายดับเพลิงขนาด 1.5 นิ้ว จะสามารถจ่ายปริมาณน้ำได้ประมาณ 150 GPM ในขณะที่สายดับเพลิงขนาด 2.5 นิ้ว จะจ่ายน้ำได้ถึง 400 GPM ซึ่งจะเปรียบเทียบได้ในหัวข้อต่อไป\n\n2. น้ำหนักของสายดับเพลิงขนาด 1.5 นิ้วนั้น ที่ขนาดความยาวประมาณ 50 ฟุตหรือ 15 เมตรนั้นจะหนัก 5 กิโลกรัมแต่ถ้าเป็นสายดับเพลิงขนาด 2.5 นิ้วจะหนักถึง 10 กิโลกรัม\n\nเห็นได้ว่าน้ำหนักจะต่างกันถึงครึ่ง นี่เป็นน้ำหนักสายเปล่า ยิ่งถ้ามีน้ำอยู่เต็มสายด้วยแล้วน้ำหนักจะเพิ่มขึ้นไปอีกหลายเท่าตัว เรื่องราวของสายส่งน้ำดับเพลิงที่กล่าวมาข้างต้นแบบคร่าวๆ  ครั้งหน้าเราจะมีพูดถึงมาตารฐานของสายและสายชนิดแบบของสายในรูปแบบอื่นๆอีกเพื่อเป็นทางเลือกสำหรับผู้ใช้งานต่อไป"
    },
    {
        "title": "หัวฉีดดับเพลิง",
        "subtitle": "รู้ถึงส่วนประกอป การใช้งาน และดูแลรักษาหัวฉีดน้ำดับเพลิง",
        "image_url": "https://raw.githubusercontent.com/woravi/layout/master/assets/fog1.png",
        "detail": "หัวฉีดดับเพลิงด้ามปืน Protek 366\nสามารถปรับรูปแบบการฉีดน้ำได้หลายระดับ ไม่ว่าจะเป็น ลำตรง กึ่งฝอยกึ่งลำตรง หรือม่านน้ำ \nมีคันโยก เปิด-ปิดน้ำ แบบ Ball Valve สามารถเปิด-ปิดน้ำที่หัวฉีดได้โดยตรง\nใช้ข้อต่อทางเข้ากับสายส่งน้ำดับเพลิงขนาด1.5 นิ้ว และสามารถใช้กับข้อต่อสวมเร็วได้ \nสามารถใช้กับหัวฉีดน้ำยาโฟมดับเพลิงได้โดยเพิ่ม Educators and foam tube \nได้รับการรับรองมาตรฐาน FM และ NFPA 1964 Standard\nหัวฉีดน้ำ Protek 366เป็นหัวฉีดน้ำดับเพลิงแรงดันสูงที่เหมาะกับนักดับเพลิงและนักผจญเพลิงโดยแท้ ด้วยฟังก์ชันที่ครบครัน และน้ำหนักเบา เคลื่อนย้ายสะดวก"
    }
]


def Home(request):
    return JsonResponse(data=data, safe=False, json_dumps_params={'ensure_ascii': False})
